Documents/Лео_ПланЗапасаГП/Лео_ПланЗапасаГП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_ПланЗапасаГП</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СценарийПланаПродаж</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОСГ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПланаПоступленияГП</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеДанныеПоДням</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеПоступлениеДня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УходимостьСредняяПоПлану</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УходимостьСредняяПоПродажамПредыдущегоПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапасСУчетомУходимостиПоПлану</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапасСУчетомУходимостиПоПродажамПредыдущегоПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеснижаемыйОстаток</name>
      <comment>2/3 от плана на 30 дней</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеДанные</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланПродажСледМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущиеОстаткиГп</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущиеОстаткиГпСУчетомОСГ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыпускПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СвободныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеПланаПроиводстваГПОбщие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланПроизводстваНаМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <comment>(Упр)</comment>
  <registerType>Turnovers</registerType>
  </aggregates>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезСкидок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.РеализацияОтгруженныхТоваров</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AccumulationRegisters/ПланыПродаж/ПланыПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланыПродаж</name>
  <comment>(Упр)</comment>
  <registerType>Turnovers</registerType>
  </aggregates>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПланирования</name>
    <type>
      <types>DocumentRef.ПланПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВариантРаспределения</name>
    <type>
      <types>EnumRef.ВариантыРаспределенияПоПериоду</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_БизнесРегион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_Территория</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_Город</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AccumulationRegisters/ТоварыВРезервеНаСкладах/ТоварыВРезервеНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВРезервеНаСкладах</name>
  <comment>(Упр)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРезерва</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Enums/абс_СтатусыОтгрузки/абс_СтатусыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыОтгрузки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подобран</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаСборка</name>
  </enumValues>
</mdclass:Enum>

Documents/Лео_ПланЗапасаГП/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Exel(*.xls)|*.xls|Документ Exel 2007(*.xmlx)|*.xlsx";
	Если Диалог.Выбрать() Тогда
		Объект.ИмяФайла = Диалог.ПолноеИмяФайла; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.ИмяФайла);

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьExcelФайл(Команда)
	Ф=Новый Файл(СокрЛП(Объект.ИмяФайла));
	Если Ф.Существует()=0 Тогда
		Сообщить("Указанный файл не существует!");
		Возврат;
	КонецЕсли;
	ВыбФайл = Новый Файл(Объект.ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		Объект.РасширениеФайла = ВыбФайл.Расширение;
		Объект.ID = ВыбФайл.ИмяБезРасширения;
	КонецЕсли;
	
	ДвоичныйФайл = ПоместитьВоВременноеХранилище ( Новый ДвоичныеДанные(Объект.ИмяФайла),ЭтаФорма.УникальныйИдентификатор); 
	ПолучитьФайлНаСервере(ДвоичныйФайл);
КонецПроцедуры

&НаСервере
Процедура ПолучитьФайлНаСервере(ДвоичныйФайл);
	
	ДанныеДокумента = ПолучитьИзВременногоХранилища(ДвоичныйФайл);
	ИмяФайлаДляЗагрузки = КаталогВременныхФайлов()+"temp" + Объект.ID + Объект.РасширениеФайла;
	ДанныеДокумента.Записать(ИмяФайлаДляЗагрузки);

	
	ФайлEXCEL = ИмяФайлаДляЗагрузки ;
	ИмяЛиста = Объект.ИмяЛиста;
	КолвоСтрокExcel = 1;
	ДанныеИзФайла = ЗагрузитьМетодом_MSADODB(ФайлEXCEL,ИмяЛиста,1,,, КолвоСтрокExcel,"MicrosoftACEOLEDB12");
	
 	ДанныеДляЗагрузки = Объект.ДанныеПланаПоступленияГП;
	ДанныеДляЗагрузкиОбщие = Объект.ДанныеПланаПроиводстваГПОбщие;
	ДанныеДляЗагрузки.Очистить();
    ДанныеДляЗагрузкиОбщие.Очистить();
	
	КононкаАртикулНоменклатуры = 5;
	КолонкаДень1 =13; 
	КолонкаПланНаМесяц =7;
	
	Для каждого СтрокаДанных из ДанныеИзФайла Цикл
		Если СокрЛП(СтрокаДанных[КононкаАртикулНоменклатуры]) <> "" Тогда
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СокрЛП(СтрокаДанных[КононкаАртикулНоменклатуры]));
		Иначе
			Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			ЗначениеЯчейкиПланНаМесяц = Формат(СтрокаДанных[КолонкаПланНаМесяц],"ЧЦ=10");

			СтрокаДанныеДляЗагрузкиОбщие = ДанныеДляЗагрузкиОбщие.Добавить();
			СтрокаДанныеДляЗагрузкиОбщие.Номенклатура = Номенклатура;
			СтрокаДанныеДляЗагрузкиОбщие.ПланПроизводстваНаМесяц = ЗначениеЯчейкиПланНаМесяц;

			Для НомерКолонки = 0 по 9 Цикл
				ЗначениеЯчейки = Формат(СтрокаДанных[КолонкаДень1 + НомерКолонки],"ЧЦ=10");
				
				СтрокаДанныеДляЗагрузки = ДанныеДляЗагрузки.Добавить();
				СтрокаДанныеДляЗагрузки.Номенклатура = Номенклатура;
				СтрокаДанныеДляЗагрузки.Дата = Объект.Дата + (НомерКолонки * 86400); 
				СтрокаДанныеДляЗагрузки.Количество = ЗначениеЯчейки;
				
			КонецЦикла
		Иначе	
		    Сообщить("Не найдена номенклатура по артикулу:" + СтрокаДанных[КононкаАртикулНоменклатуры]);
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Функция ЗаменитьСимволы(Стр)
	Стр = СтрЗаменить(Стр, " ", "");
	Стр = СтрЗаменить(Стр, "-", "");
	Стр = СтрЗаменить(Стр, "/", "");
	Стр = СтрЗаменить(Стр, ":", "");
	Стр = СтрЗаменить(Стр, ".", "");
	Стр = СтрЗаменить(Стр, "№", "");
	Стр = СтрЗаменить(Стр, "(", "");
	Стр = СтрЗаменить(Стр, ")", "");
	Возврат Стр;
КонецФункции

&НаСервере
Функция ЗагрузитьМетодом_MSADODB(Знач ФайлEXCEL, Знач ИмяЛиста, Знач СтрокаЗаголовка = 3, НачСтрока = 0, КонСтрока = 0, КолвоСтрокExcel, 
	Знач ПодключениеADODB = "MicrosoftJetOLEDB40") Экспорт
	Перем СonnectionString, ADODBConnection, ADODBRecordset, ТекстЗапроса;
	Перем КолвоКолонокExcel, Поле, Колонка, ИмяКолонки;
	Перем НоваяСтрока, НомерСтроки;
	Перем ТаблицаРезультат;
	
	// Нумерация MS ADODB начинается с 1.
	
	// Переменная "СтрокаЗаголовка", не используется, т.к. HDR=YES, а не HDR=NO.
	// HDR=YES:
	// 1. Считывание заголовков колонок с 1-ой строки.
	// 2. Считываемые данные со 2-ой и последующих строк типизированы. Для варианта HDR=NO: считываемые данные - строка.
	
	// Строка соединения - определение драйвера, который будет использован для подключения к файлу EXCEL.
	Если ПодключениеADODB = "MicrosoftACEOLEDB12" Тогда
		
		// ACE.OLEDB.12.0 - Для использования данного подключения необходимо дополнительное ПО:
		// Microsoft Access Database Engine 2010 Redistributable 32/64 bit.
		//Для корректной работы также установил:
		//http://www.microsoft.com/en-us/download/details.aspx?id=13255
		//http://www.microsoft.com/en-us/download/details.aspx?id=23734		
		
		СonnectionString = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source= " + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 12.0;HDR=NO;IMEX=1;""";
		
		// Еще один вариант.
		//СтрокаСоединения = "Driver={Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)};Dbq=" + СокрЛП(ФайлEXCEL) + ";";
		
	Иначе
		
		// Jet.OLEDB.4.0 - Стандартное подключение, как правило, не требующее установки дополнительного ПО. 
		// Рекомендуется установить последний Service Pack Windows.
		СonnectionString = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source= "  + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 8.0;HDR=NO;IMEX=1;""";
		
		// Еще один вариант.
		//СтрокаСоединения = "Driver={Microsoft Excel Driver (*.xls)};Dbq=" + СокрЛП(ФайлEXCEL) + ";";
		
	КонецЕсли;
	
	Попытка
		// Инициализация основного объекта ADODB.Connection. Открытие соединения.
		ADODBConnection = Новый COMОбъект("ADODB.Connection");
		ADODBConnection.ConnectionString =  СonnectionString;
		ADODBConnection.Open();
		// Импирически определенный параметр для правильного определения количества строк листа.
		ADODBConnection.CursorLocation = 3;    // По-умолчанию 2.
	Исключение
		Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецПопытки;
	
	ТекстЗапроса = "SELECT * FROM [" + ИмяЛиста + "$]";
	
	// Создание Recordset. Дочерний объект ADODBConnection. Набор записей по запросу.
	Попытка
		ADODBRecordset = Новый COMОбъект("ADODB.Recordset");
		ADODBRecordset.Open(ТекстЗапроса, ADODBConnection);
		
		// Проверка заполненности листа.
		Если (ADODBRecordset.EOF ИЛИ ADODBRecordset.BOF) Тогда
			КолвоСтрокExcel = 0;
			Сообщить(НСтр("ru = '" + ИмяЛиста + ": не содержит данных.'"), СтатусСообщения.Внимание);
			
			// Завершение работы.
			// Закрытие Объектов.
			ADODBRecordset.Close();
			ADODBConnection.Close();
			ADODBRecordset   = Неопределено;
			ADODBConnection = Неопределено;
			
			Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
		КонецЕсли;
		
		// Импирически определенные параметры для правильного определения количества строк листа.
		ADODBRecordset.AbsolutePage     = 1;
		ADODBRecordset.AbsolutePosition = 1;
	Исключение
		Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецПопытки;
	
	// Параметр, возвращаемый в вызывающую процедуру.
	КолвоСтрокExcel = ADODBRecordset.RecordCount + 1;    // (+1) - учет Строки-Заголовока, которая "съедается".
	КолвоКолонокExcel = ADODBRecordset.Fields.Count;
	
	// Проверка заполненности листа.
	Если КолвоСтрокExcel <= 2 Тогда
		КолвоСтрокExcel = 0;
		Сообщить(НСтр("ru = '" + ИмяЛиста + ": не содержит данных.'"), СтатусСообщения.Внимание);
		
		// Завершение работы.
		// Закрытие Объектов.
		ADODBRecordset.Close();
		ADODBConnection.Close();
		ADODBRecordset   = Неопределено;
		ADODBConnection = Неопределено;
		
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецЕсли;
	
	// Создание результирующей таблицы, в которую будут записываться считанные из EXCEL данные.
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	// Формирование колонок результирующей таблицы.
	
	// "НомерСтроки" - для наглядности и удобства.
	// В зависимости от разрабатываемой обработки.
	// "Сопоставлено" - может быть другим.
	// Здесь же могут быть добавлены другие колонки, не формируемые из содержимого файла EXCEL.
	
	//ТаблицаРезультат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"), "№", 4);
	//ТаблицаРезультат.Колонки.Добавить("Сопоставлено", Новый ОписаниеТипов("Булево"), "Сопоставлено", 1);
	
	Для ит = 1 ПО КолвоКолонокExcel Цикл
		
		Поле = ADODBRecordset.Fields.Item(ит - 1);
		ИмяКолонки = "К_" + ит;
		//ИмяКолонки = Поле.Value;
		//Колонка = ТаблицаРезультат.Колонки.Добавить(ИмяКолонки, , СокрЛП(СтрЗаменить(Поле.Name, "#", ".")));
		ИмяКолонки = ЗаменитьСимволы(ИмяКолонки);
		Колонка = ТаблицаРезультат.Колонки.Добавить(ИмяКолонки, ,ИмяКолонки);
		
		// Замена "#" на ".", т.к. при считывании ADODB "." в имени колонки заменяется на "#".
	КонецЦикла;
	
	// ТаблицаРезультат: 1-я строка - Строка-Заголовок.
	
	// Добавление этой строки обусловлено исключительно из соображений идентичности содержимого файла EXCEL и ТаблицыЗначений,
	// выводимой на форме Обработки, и дальнейшей обработки строки заголовка
	// с целью сопоставления колонок EXCEL и реквизитов 1С: для Справочников, ПВХ, Регистров, Документов.
	
	// Если в Вашей обработке в результирующей таблице в качестве 1-ой строки не нужна Строка-Заголовок, то
	// следует закомментировать следующий цикл:
	//НоваяСтрока = ТаблицаРезультат.Добавить();
	//НоваяСтрока.НомерСтроки = 1;
	//Для ит = 1 ПО КолвоКолонокExcel Цикл
	//	
	//	ИмяКолонки = "К_" + ит;
	//	Колонка = ТаблицаРезультат.Колонки.Найти(ИмяКолонки);
	//	НоваяСтрока[ИмяКолонки] = Колонка.Заголовок;
	//	
	//КонецЦикла;
	
	// ТаблицаРезультат: Формирование строк по указанному диапазону: НачСтрока - КонСтрока.
	
	НомерСтроки = 1;
	НачСтрока =  СтрокаЗаголовка+1;
	Пока ADODBRecordset.EOF() = 0 Цикл
		
		//НомерСтроки = НомерСтроки + 1;
		
		Если НомерСтроки < НачСтрока Тогда    // Номер строки вне диапазона считываемых строк.
			ADODBRecordset.MoveNext();             // Следующая строка.
			//Продолжить;
			НомерСтроки = НомерСтроки + 1;
			Продолжить;
		КонецЕсли;
		
		Если КонСтрока > 0 И НомерСтроки > КонСтрока Тогда    // Номер строки вне диапазона считываемых строк.
			Прервать;
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		//НоваяСтрока.НомерСтроки = НомерСтроки;
		
		Для ит = 1 ПО КолвоКолонокExcel Цикл
			
			Поле = ADODBRecordset.Fields.Item(ит - 1);
			
			Если Поле.ActualSize = 0 Тогда        // Пустое поле EXCEL.
				Продолжить;
			КонецЕсли;
			
			ЗначениеЯчейки = Поле.Value;        // Учитывая параметр HDR=YES в строке соединения, данные считываются в соответствии с их типом.
			
			ИмяКолонки = ит-1;
			НоваяСтрока[ИмяКолонки] = ЗначениеЯчейки;
			
			// Используется при формировании таблицы на форме обработки.
			//ШиринаКолонки = ТаблицаРезультат.Колонки[ИмяКолонки].Ширина;
			//ДлинаСтроки      = СтрДлина(СокрЛП(ЗначениеЯчейки));
			//ТаблицаРезультат.Колонки[ИмяКолонки].Ширина = ?(ШиринаКолонки < ДлинаСтроки, ДлинаСтроки, ШиринаКолонки);
			
		КонецЦикла;
		
		ADODBRecordset.MoveNext();   // Следующая строка.
		
	КонецЦикла;
	
	//УдалитьКолонкиСНулевойШириной(ТаблицаРезультат);
	
	// Завершение работы.
	// Закрытие Объектов.
	ADODBRecordset.Close();
	ADODBConnection.Close();
	ADODBRecordset   = Неопределено;
	ADODBConnection = Неопределено;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

&НаКлиенте
Процедура РасчитатьДанные(Команда)
	Если Объект.ДанныеПланаПоступленияГП.Количество()=0 тогда
		Сообщить ("Не заполнена табличная часть ""Данные плана поступления ГП"". Неоходимо внести данные о плане поступления готовой продукции. ");
		Возврат
	КонецЕсли;
	
	Если Объект.РасчетныеДанные.Количество()>0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Перед заполнением табличная часть будет очищена, продолжить?";
     	Ответ = Вопрос(Текст, Режим, 0);
        Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
	КонецЕсли;
	РасчитатьДанныеНаСервере();
		
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьДанныеНаСервере() 
	
	СтруктураДанныеЗапросов = ПолучитьДанныеПланаФактаОстатковЗапросом();	
		
	Объект.РасчетныеДанные.Загрузить(СтруктураДанныеЗапросов.РасчетныеДанные);
    Объект.РасчетныеДанныеПоДням.Загрузить(СтруктураДанныеЗапросов.РасчетныеДанныеПоДням);
	
    РасчитатьОстатокСУчетомУходимости() ;
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьДанныеПланаФактаОстатковЗапросом()
	
	СписокСвоихКонтрагентов = новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыСвязанныеСОрганизациямиСрезПоследних.Контрагент
		|ИЗ
		|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями.СрезПоследних КАК КонтрагентыСвязанныеСОрганизациямиСрезПоследних";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокСвоихКонтрагентов.Добавить(ВыборкаДетальныеЗаписи.Контрагент);
	КонецЦикла;
	
	СписокСкладов = новый СписокЗначений;
	Для каждого СтрокаСклад из Объект.Склады Цикл
		СписокСкладов.Добавить(СтрокаСклад.Склад);
	КонецЦикла;
		
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
		|	РегламентированныйПроизводственныйКалендарь.Пятидневка
		|ПОМЕСТИТЬ Вт_Календарь
		|ИЗ
		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|ГДЕ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаПо, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток,
		|	&ДатаС КАК Дата,
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ), ТоварыНаСкладахОстатки.СерияНоменклатуры.СрокГодности, ДЕНЬ) КАК ОстаточныйСрокГодности,
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ), ТоварыНаСкладахОстатки.СерияНоменклатуры.СрокГодности, ДЕНЬ) / РАЗНОСТЬДАТ(ТоварыНаСкладахОстатки.СерияНоменклатуры.абс_ДатаПроизводства, ТоварыНаСкладахОстатки.СерияНоменклатуры.СрокГодности, ДЕНЬ) * 100 КАК ПроцентСвежести
		|ПОМЕСТИТЬ Вт_ОстаткиПоСкладам
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ), ) КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.Склад В(&СписокСкладов)
		|	И ТоварыНаСкладахОстатки.Номенклатура.Артикул <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыпускПродукцииПродукция.Номенклатура,
		|	СУММА(ВыпускПродукцииПродукция.Количество),
		|	МАКСИМУМ(НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ)),
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ), ВыпускПродукцииПродукция.СерияНоменклатуры.СрокГодности, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(ВыпускПродукцииПродукция.СерияНоменклатуры.абс_ДатаПроизводства, ВыпускПродукцииПродукция.СерияНоменклатуры.СрокГодности, ДЕНЬ) > 0
		|			ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ), ВыпускПродукцииПродукция.СерияНоменклатуры.СрокГодности, ДЕНЬ) / РАЗНОСТЬДАТ(ВыпускПродукцииПродукция.СерияНоменклатуры.абс_ДатаПроизводства, ВыпускПродукцииПродукция.СерияНоменклатуры.СрокГодности, ДЕНЬ) * 100
		|		ИНАЧЕ 100
		|	КОНЕЦ
		|ИЗ
		|	Документ.ВыпускПродукции.Продукция КАК ВыпускПродукцииПродукция
		|ГДЕ
		|	ВыпускПродукцииПродукция.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ) И ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ), ЧАС, 10)
		|	И ВыпускПродукцииПродукция.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыпускПродукцииПродукция.Номенклатура,
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ), ВыпускПродукцииПродукция.СерияНоменклатуры.СрокГодности, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(ВыпускПродукцииПродукция.СерияНоменклатуры.абс_ДатаПроизводства, ВыпускПродукцииПродукция.СерияНоменклатуры.СрокГодности, ДЕНЬ) > 0
		|			ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ), ВыпускПродукцииПродукция.СерияНоменклатуры.СрокГодности, ДЕНЬ) / РАЗНОСТЬДАТ(ВыпускПродукцииПродукция.СерияНоменклатуры.абс_ДатаПроизводства, ВыпускПродукцииПродукция.СерияНоменклатуры.СрокГодности, ДЕНЬ) * 100
		|		ИНАЧЕ 100
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.КоличествоФакт,
		|	РабочихДнейМесяцаВПериоде.КоличестывоДней КАК ДнейМесяцаВПериоде,
		|	РабочихДнейМесяца.КоличестывоДней КАК ДнейМесяца,
		|	РабочихДнеДоКонцаПериода.КоличестывоДней КАК ДнеДоКонцаПериода,
		|	ВложенныйЗапрос.КоличествоПлан
		|ПОМЕСТИТЬ Вт_ПланФактПродаж
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|		ВложенныйЗапрос.Период КАК Период,
		|		СУММА(ВложенныйЗапрос.КоличествоФакт) КАК КоличествоФакт,
		|		СУММА(ВложенныйЗапрос.КоличествоПлан) КАК КоличествоПлан
		|	ИЗ
		|		(ВЫБРАТЬ
		|			Продажи.Номенклатура КАК Номенклатура,
		|			НАЧАЛОПЕРИОДА(Продажи.Период, МЕСЯЦ) КАК Период,
		|			СУММА(Продажи.Количество) КАК КоличествоФакт,
		|			0 КАК КоличествоПлан
		|		ИЗ
		|			РегистрНакопления.Продажи КАК Продажи
		|		ГДЕ
		|			Продажи.Период МЕЖДУ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаС, МЕСЯЦ), МЕСЯЦ, -1) И КОНЕЦПЕРИОДА(&ДатаПо, МЕСЯЦ)
		|			И НЕ Продажи.Контрагент В (&СписокСвоихКонтрагентов)
		|			И Продажи.Номенклатура.Артикул <> """"
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Продажи.Номенклатура,
		|			НАЧАЛОПЕРИОДА(Продажи.Период, МЕСЯЦ)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПланыПродаж.Номенклатура,
		|			ПланыПродаж.Период,
		|			0,
		|			СУММА(ПланыПродаж.Количество)
		|		ИЗ
		|			РегистрНакопления.ПланыПродаж КАК ПланыПродаж
		|		ГДЕ
		|			ПланыПродаж.Сценарий = &СценарийПланаПродаж
		|			И ПланыПродаж.Период МЕЖДУ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаС, МЕСЯЦ), МЕСЯЦ, -1) И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаПо, МЕСЯЦ), МЕСЯЦ, 1)
		|			И ПланыПродаж.Количество > 0
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПланыПродаж.Номенклатура,
		|			ПланыПродаж.Период
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			Вт_ОстаткиПоСкладам.Номенклатура,
		|			НАЧАЛОПЕРИОДА(Вт_ОстаткиПоСкладам.Дата, МЕСЯЦ),
		|			0,
		|			0
		|		ИЗ
		|			Вт_ОстаткиПоСкладам КАК Вт_ОстаткиПоСкладам) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Номенклатура,
		|		ВложенныйЗапрос.Период) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК Месяц,
		|			СУММА(РегламентированныйПроизводственныйКалендарь.Пятидневка) КАК КоличестывоДней
		|		ИЗ
		|			РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|		ГДЕ
		|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаПо, МЕСЯЦ)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ)) КАК РабочихДнеДоКонцаПериода
		|		ПО ВложенныйЗапрос.Период = РабочихДнеДоКонцаПериода.Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК Месяц,
		|			СУММА(РегламентированныйПроизводственныйКалендарь.Пятидневка) КАК КоличестывоДней
		|		ИЗ
		|			РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|		ГДЕ
		|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаПо, ДЕНЬ)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ)) КАК РабочихДнейМесяцаВПериоде
		|		ПО ВложенныйЗапрос.Период = РабочихДнейМесяцаВПериоде.Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК Месяц,
		|			СУММА(РегламентированныйПроизводственныйКалендарь.Пятидневка) КАК КоличестывоДней
		|		ИЗ
		|			РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|		ГДЕ
		|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаС, МЕСЯЦ), МЕСЯЦ, -1) И КОНЕЦПЕРИОДА(&ДатаПо, МЕСЯЦ)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ)) КАК РабочихДнейМесяца
		|		ПО ВложенныйЗапрос.Период = РабочихДнейМесяца.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ДатаКалендаря,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.КоличестывоДней,
		|	ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличестывоДней КАК СреднееПоПлануПродаж
		|ПОМЕСТИТЬ ВТ_СреднееПоПлануПродажНаКаждыйРабочийДень
		|ИЗ
		|	(ВЫБРАТЬ
		|		Даты.ДатаКалендаря КАК ДатаКалендаря,
		|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|		ВложенныйЗапрос.Количество КАК Количество,
		|		ВложенныйЗапрос.КоличестывоДней КАК КоличестывоДней
		|	ИЗ
		|		(ВЫБРАТЬ
		|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря,
		|			РегламентированныйПроизводственныйКалендарь.Пятидневка КАК Пятидневка
		|		ИЗ
		|			РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|		ГДЕ
		|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ) И ДОБАВИТЬКДАТЕ(&ДатаС, ДЕНЬ, 45)
		|			И РегламентированныйПроизводственныйКалендарь.Пятидневка = 1) КАК Даты
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ПланыПродаж.Номенклатура КАК Номенклатура,
		|				ПланыПродаж.Период КАК Период,
		|				СУММА(ПланыПродаж.Количество) КАК Количество,
		|				РабочиеДниМесяца.КоличестывоДней КАК КоличестывоДней
		|			ИЗ
		|				РегистрНакопления.ПланыПродаж КАК ПланыПродаж
		|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|						НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК Месяц,
		|						СУММА(РегламентированныйПроизводственныйКалендарь.Пятидневка) КАК КоличестывоДней
		|					ИЗ
		|						РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|					ГДЕ
		|						РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаС, МЕСЯЦ) И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаС, МЕСЯЦ), МЕСЯЦ, 2)
		|					
		|					СГРУППИРОВАТЬ ПО
		|						НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ)) КАК РабочиеДниМесяца
		|					ПО ПланыПродаж.Период = РабочиеДниМесяца.Месяц
		|			ГДЕ
		|				ПланыПродаж.Сценарий = &СценарийПланаПродаж
		|				И ПланыПродаж.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаС, МЕСЯЦ) И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаС, МЕСЯЦ), МЕСЯЦ, 2)
		|				И ПланыПродаж.Количество > 0
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПланыПродаж.Номенклатура,
		|				ПланыПродаж.Период,
		|				РабочиеДниМесяца.КоличестывоДней) КАК ВложенныйЗапрос
		|			ПО (НАЧАЛОПЕРИОДА(Даты.ДатаКалендаря, МЕСЯЦ) = ВложенныйЗапрос.Период)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Даты.ДатаКалендаря,
		|		ВложенныйЗапрос.Номенклатура,
		|		ВложенныйЗапрос.Количество,
		|		ВложенныйЗапрос.КоличестывоДней) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
		|	СУММА(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Резерв
		|ИЗ
		|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ДатаС, ) КАК ТоварыВРезервеНаСкладахОстатки
		|ГДЕ
		|	ТоварыВРезервеНаСкладахОстатки.Склад В(&СписокСкладов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПланФакт.Номенклатура,
		|	ЕСТЬNULL(ПланФакт.ФактПродаж, 0) КАК ФактПродаж,
		|	ЕСТЬNULL(Остатки.ТекущиеОстаткиГп, 0) КАК ТекущиеОстаткиГп,
		|	ЕСТЬNULL(Остатки.ТекущиеОстаткиГпСУчетомОСГ, 0) КАК ТекущиеОстаткиГпСУчетомОСГ,
		|	ЕСТЬNULL(ВыпускПродукции.Количество, 0) КАК ВыпускПродукции,
		|	ЕСТЬNULL(Остатки.ТекущиеОстаткиГп, 0) - ЕСТЬNULL(ВТ_Резерв.КоличествоОстаток, 0) КАК СвободныйОстаток,
		|	ЕСТЬNULL(ПланФакт.ПланПродаж, 0) КАК ПланПродаж,
		|	ЕСТЬNULL(ПланФакт.ПланПродажСледМесяц, 0) КАК ПланПродажСледМесяц
		|ИЗ
		|	(ВЫБРАТЬ
		|		НоменклатураИзПланФакта.Номенклатура КАК Номенклатура,
		|		СУММА(ПродажиТекущегоМесяца.КоличествоФакт) КАК ФактПродаж,
		|		СУММА(ПланыПродаж.ПланПродаж) КАК ПланПродаж,
		|		СУММА(ПланыПродаж.ПланПродажСледМесяц) КАК ПланПродажСледМесяц
		|	ИЗ
		|		(ВЫБРАТЬ
		|			Вт_ПланФактПродаж.Номенклатура КАК Номенклатура
		|		ИЗ
		|			Вт_ПланФактПродаж КАК Вт_ПланФактПродаж
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Вт_ПланФактПродаж.Номенклатура) КАК НоменклатураИзПланФакта
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				Продажи.Номенклатура КАК Номенклатура,
		|				СУММА(Продажи.Количество) КАК КоличествоФакт
		|			ИЗ
		|				РегистрНакопления.Продажи КАК Продажи
		|			ГДЕ
		|				Продажи.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаС, МЕСЯЦ) И &ДатаС
		|				И НЕ Продажи.Контрагент В (&СписокСвоихКонтрагентов)
		|				И Продажи.Номенклатура.Артикул <> """"
		|				И Продажи.ДокументПродажи.абс_Статус = ЗНАЧЕНИЕ(перечисление.абс_СтатусыОтгрузки.Отгружен)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				Продажи.Номенклатура) КАК ПродажиТекущегоМесяца
		|			ПО НоменклатураИзПланФакта.Номенклатура = ПродажиТекущегоМесяца.Номенклатура
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				Вт_ПланФактПродаж.Номенклатура КАК Номенклатура,
		|				СУММА(ВЫБОР
		|						КОГДА Вт_ПланФактПродаж.Период = НАЧАЛОПЕРИОДА(&ДатаС, МЕСЯЦ)
		|							ТОГДА Вт_ПланФактПродаж.КоличествоПлан
		|						ИНАЧЕ 0
		|					КОНЕЦ) КАК ПланПродаж,
		|				СУММА(ВЫБОР
		|						КОГДА Вт_ПланФактПродаж.Период = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаС, МЕСЯЦ), МЕСЯЦ, 1)
		|							ТОГДА Вт_ПланФактПродаж.КоличествоПлан
		|						ИНАЧЕ 0
		|					КОНЕЦ) КАК ПланПродажСледМесяц
		|			ИЗ
		|				Вт_ПланФактПродаж КАК Вт_ПланФактПродаж
		|			
		|			СГРУППИРОВАТЬ ПО
		|				Вт_ПланФактПродаж.Номенклатура) КАК ПланыПродаж
		|			ПО НоменклатураИзПланФакта.Номенклатура = ПланыПродаж.Номенклатура
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НоменклатураИзПланФакта.Номенклатура) КАК ПланФакт
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Вт_ОстаткиПоСкладам.Номенклатура КАК Номенклатура,
		|			СУММА(Вт_ОстаткиПоСкладам.КоличествоОстаток) КАК ТекущиеОстаткиГп,
		|			СУММА(ВЫБОР
		|					КОГДА Вт_ОстаткиПоСкладам.ПроцентСвежести >= &ПроцентОСГ
		|						ТОГДА Вт_ОстаткиПоСкладам.КоличествоОстаток
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК ТекущиеОстаткиГпСУчетомОСГ
		|		ИЗ
		|			Вт_ОстаткиПоСкладам КАК Вт_ОстаткиПоСкладам
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Вт_ОстаткиПоСкладам.Номенклатура) КАК Остатки
		|		ПО ПланФакт.Номенклатура = Остатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВыпускПродукции.Продукция КАК Номенклатура,
		|			СУММА(ВыпускПродукции.Количество) КАК Количество
		|		ИЗ
		|			РегистрНакопления.ВыпускПродукции КАК ВыпускПродукции
		|		ГДЕ
		|			ВыпускПродукции.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаС, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаС, ДЕНЬ)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВыпускПродукции.Продукция) КАК ВыпускПродукции
		|		ПО ПланФакт.Номенклатура = ВыпускПродукции.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Резерв КАК ВТ_Резерв
		|		ПО ПланФакт.Номенклатура = ВТ_Резерв.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Дата,
		|	ВложенныйЗапрос.Номенклатура,
		|	СУММА(ВложенныйЗапрос.ЗапасГотовойПродукции) КАК ЗапасГотовойПродукции,
		|	МАКСИМУМ(ВложенныйЗапрос.ПлановыйРасходДня) КАК УходимостьСредняяПоПлану,
		|	МАКСИМУМ(ВложенныйЗапрос.ПлановыйРасходДняРетраспективно) КАК УходимостьСредняяПоПродажамПредыдущегоПериода,
		|	ЕСТЬNULL(НеснидаемыйОстаток.СреднееПоПлануПродаж / 3 * 2, 0) КАК НеснижаемыйОстаток,
		|	ВложенныйЗапрос.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|ИЗ
		|	(ВЫБРАТЬ
		|		Вт_Календарь.ДатаКалендаря КАК Дата,
		|		Вт_ОстаткиПоСкладам.Номенклатура КАК Номенклатура,
		|		СУММА(ВЫБОР
		|				КОГДА Вт_ОстаткиПоСкладам.ОстаточныйСрокГодности >= &ПроцентОСГ
		|					ТОГДА Вт_ОстаткиПоСкладам.КоличествоОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК ЗапасГотовойПродукции,
		|		СУММА(0) КАК ПлановыйРасходДня,
		|		СУММА(0) КАК ПлановыйРасходДняРетраспективно
		|	ИЗ
		|		Вт_Календарь КАК Вт_Календарь
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Вт_ОстаткиПоСкладам КАК Вт_ОстаткиПоСкладам
		|			ПО Вт_Календарь.ДатаКалендаря = Вт_ОстаткиПоСкладам.Дата
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Вт_Календарь.ДатаКалендаря,
		|		Вт_ОстаткиПоСкладам.Номенклатура
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВложенныйЗапрос.Дата,
		|		ВложенныйЗапрос.Номенклатура,
		|		СУММА(0),
		|		СУММА(ВложенныйЗапрос.ПлановыйРасходДня),
		|		СУММА(0)
		|	ИЗ
		|		(ВЫБРАТЬ
		|			Вт_Календарь.ДатаКалендаря КАК Дата,
		|			Вт_ПланПродаж.Номенклатура КАК Номенклатура,
		|			ВЫБОР
		|				КОГДА Вт_Календарь.Пятидневка > 0
		|					ТОГДА Вт_ПланПродаж.КоличествоПлан / Вт_ПланПродаж.ДнейМесяца
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ПлановыйРасходДня
		|		ИЗ
		|			Вт_Календарь КАК Вт_Календарь
		|				ЛЕВОЕ СОЕДИНЕНИЕ Вт_ПланФактПродаж КАК Вт_ПланПродаж
		|				ПО (МЕСЯЦ(Вт_Календарь.ДатаКалендаря) = МЕСЯЦ(Вт_ПланПродаж.Период))) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Дата,
		|		ВложенныйЗапрос.Номенклатура
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказПокупателяТовары.Ссылка.ДатаОтгрузки,
		|		ЗаказПокупателяТовары.Номенклатура,
		|		СУММА(0),
		|		СУММА(ЗаказПокупателяТовары.Количество),
		|		СУММА(ЗаказПокупателяТовары.Количество)
		|	ИЗ
		|		Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|	ГДЕ
		|		НЕ ЗаказПокупателяТовары.Ссылка.Контрагент В (&СписокСвоихКонтрагентов)
		|		И ЗаказПокупателяТовары.Ссылка.Проведен = ИСТИНА
		|		И ЗаказПокупателяТовары.Ссылка.ДатаОтгрузки МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаПо, ДЕНЬ)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗаказПокупателяТовары.Ссылка.ДатаОтгрузки,
		|		ЗаказПокупателяТовары.Номенклатура
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Вт_Календарь.ДатаКалендаря,
		|		ВложенныйЗапрос.Номенклатура,
		|		СУММА(0),
		|		СУММА(0),
		|		СУММА(ВЫБОР
		|				КОГДА Вт_Календарь.Пятидневка > 0
		|					ТОГДА ВЫБОР
		|							КОГДА ВложенныйЗапрос.Период > ВложенныйЗапрос.КоличестывоДней
		|								ТОГДА ВложенныйЗапрос.КоличествоФакт / ВложенныйЗапрос.Период
		|							ИНАЧЕ ВложенныйЗапрос.КоличествоФакт / ВложенныйЗапрос.КоличестывоДней
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ)
		|	ИЗ
		|		Вт_Календарь КАК Вт_Календарь,
		|		(ВЫБРАТЬ
		|			Продажи.Номенклатура КАК Номенклатура,
		|			СУММА(Продажи.Количество) КАК КоличествоФакт,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НАЧАЛОПЕРИОДА(Продажи.Период, ДЕНЬ)) КАК Период,
		|			МАКСИМУМ(РабочихДнейМесяцаВПериоде.КоличестывоДней) КАК КоличестывоДней
		|		ИЗ
		|			РегистрНакопления.Продажи КАК Продажи,
		|			(ВЫБРАТЬ
		|				СУММА(РегламентированныйПроизводственныйКалендарь.Пятидневка) КАК КоличестывоДней
		|			ИЗ
		|				РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|			ГДЕ
		|				РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаС, ДЕНЬ, -30) И НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ)) КАК РабочихДнейМесяцаВПериоде
		|		ГДЕ
		|			Продажи.Период МЕЖДУ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ), ДЕНЬ, -30) И &ДатаС
		|			И НЕ Продажи.Контрагент В (&СписокСвоихКонтрагентов)
		|			И Продажи.Номенклатура.Артикул <> """"
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Продажи.Номенклатура) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Вт_Календарь.ДатаКалендаря,
		|		ВложенныйЗапрос.Номенклатура) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Вт_Календарь.ДатаКалендаря КАК ДатаКалендаря,
		|			СУММА(ВТ_СреднееПоПлануПродажНаКаждыйРабочийДень.СреднееПоПлануПродаж) КАК СреднееПоПлануПродаж,
		|			ВТ_СреднееПоПлануПродажНаКаждыйРабочийДень.Номенклатура КАК Номенклатура
		|		ИЗ
		|			Вт_Календарь КАК Вт_Календарь
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СреднееПоПлануПродажНаКаждыйРабочийДень КАК ВТ_СреднееПоПлануПродажНаКаждыйРабочийДень
		|				ПО (ВТ_СреднееПоПлануПродажНаКаждыйРабочийДень.ДатаКалендаря МЕЖДУ Вт_Календарь.ДатаКалендаря И ДОБАВИТЬКДАТЕ(Вт_Календарь.ДатаКалендаря, ДЕНЬ, 30))
		|		ГДЕ
		|			Вт_Календарь.Пятидневка = 1
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Вт_Календарь.ДатаКалендаря,
		|			ВТ_СреднееПоПлануПродажНаКаждыйРабочийДень.Номенклатура) КАК НеснидаемыйОстаток
		|		ПО ВложенныйЗапрос.Номенклатура = НеснидаемыйОстаток.Номенклатура
		|			И ВложенныйЗапрос.Дата = НеснидаемыйОстаток.ДатаКалендаря
		|ГДЕ
		|	(НЕ ВложенныйЗапрос.ПлановыйРасходДня = 0
		|			ИЛИ НЕ ВложенныйЗапрос.ПлановыйРасходДняРетраспективно = 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Дата,
		|	ВложенныйЗапрос.Номенклатура,
		|	ЕСТЬNULL(НеснидаемыйОстаток.СреднееПоПлануПродаж / 3 * 2, 0),
		|	ВложенныйЗапрос.Номенклатура.НоменклатурнаяГруппа";

	Запрос.УстановитьПараметр("ДатаПо", НачалоДня(Объект.Дата) + 864000);
	Запрос.УстановитьПараметр("ДатаС", Объект.Дата);
	Запрос.УстановитьПараметр("СписокСвоихКонтрагентов", СписокСвоихКонтрагентов);
	Запрос.УстановитьПараметр("СписокСкладов", СписокСкладов);
    Запрос.УстановитьПараметр("СценарийПланаПродаж", Объект.СценарийПланаПродаж);
    Запрос.УстановитьПараметр("ПроцентОСГ", Объект.ПроцентОСГ);


	Результаты = Запрос.ВыполнитьПакет();


	Возврат Новый Структура("РасчетныеДанные,РасчетныеДанныеПоДням",Результаты[5].Выгрузить(),Результаты[6].Выгрузить())

	
КонецФункции	

&НаСервере
Процедура РасчитатьОстатокСУчетомУходимости()	
	ТзНоменклатура  =  Объект.РасчетныеДанныеПоДням.Выгрузить(,"Номенклатура");
	ТзНоменклатура.Свернуть("Номенклатура");	
	
	ТчРасчетныеДанныеПоДням = Объект.РасчетныеДанныеПоДням;
	ТчРасчетныеДанные = Объект.РасчетныеДанные;
    ТчДанныеПланаПоступленияГП = Объект.ДанныеПланаПоступленияГП;
	
	Для каждого СтрокаНоменклатура из ТзНоменклатура Цикл
		ДатаСтроки = НачалоДня(Объект.Дата);	
		КонечнаяДата = ДатаСтроки + 864000;

		
		ПараметрыОтбораРД = Новый Структура;
		ПараметрыОтбораРД.Вставить("Номенклатура", СтрокаНоменклатура.Номенклатура);
		НайденныеСтрокиРасчетныеДанные =  ТчРасчетныеДанные.НайтиСтроки(ПараметрыОтбораРД);
		
		//Данные из "РасчетныеДанные"
		Если НайденныеСтрокиРасчетныеДанные.количество() = 0 Тогда
			ТекущиеОстаткиГп = 0;
			ТекущиеОстаткиГпСУчетомОСГ = 0;	
		Иначе
			ТекущиеОстаткиГп = НайденныеСтрокиРасчетныеДанные[0].ТекущиеОстаткиГп;
			ТекущиеОстаткиГпСУчетомОСГ = НайденныеСтрокиРасчетныеДанные[0].ТекущиеОстаткиГпСУчетомОСГ;
		КонецЕсли;
		
		ЗапасСУчетомУходимостиПоПлану =  ТекущиеОстаткиГп;
		ЗапасСУчетомУходимостиПоПродажамПредыдущегоПериода  = ТекущиеОстаткиГп;
		
		Пока ДатаСтроки <= КонечнаяДата Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", СтрокаНоменклатура.Номенклатура);
            ПараметрыОтбора.Вставить("Дата",ДатаСтроки);
			
			НайденныеСтрокиРасчетныеДанныеПоДням =  ТчРасчетныеДанныеПоДням.НайтиСтроки(ПараметрыОтбора);
			НайденныеСтрокиДанныеПланаПоступленияГП =  ТчДанныеПланаПоступленияГП.НайтиСтроки(ПараметрыОтбора);
			
			//Поступление на дату (Данные полученые из excel)
			Если НайденныеСтрокиДанныеПланаПоступленияГП.количество() = 0 Тогда
				ПоступлениеНаДату = 0;
			Иначе
				ПоступлениеНаДату = НайденныеСтрокиДанныеПланаПоступленияГП[0].Количество;
			КонецЕсли;
			
			
			//Получаем строку из "РасчетныеДанныеПоДням"
			Если НайденныеСтрокиРасчетныеДанныеПоДням.количество() = 0 Тогда
				СтрокаРасчетныеДанныеПоДням =	ТчРасчетныеДанныеПоДням.Добавить();
				СтрокаРасчетныеДанныеПоДням.Номенклатура = СтрокаНоменклатура.Номенклатура;
				СтрокаРасчетныеДанныеПоДням.НоменклатурнаяГруппа = СтрокаНоменклатура.Номенклатура.НоменклатурнаяГруппа;
				СтрокаРасчетныеДанныеПоДням.Дата = ДатаСтроки;
			Иначе
				СтрокаРасчетныеДанныеПоДням = НайденныеСтрокиРасчетныеДанныеПоДням[0];
			КонецЕсли;
			
			//Расчет
			ЗапасСУчетомУходимостиПоПлану =  ЗапасСУчетомУходимостиПоПлану + ПоступлениеНаДату - СтрокаРасчетныеДанныеПоДням.УходимостьСредняяПоПлану;
			ЗапасСУчетомУходимостиПоПродажамПредыдущегоПериода  = ЗапасСУчетомУходимостиПоПродажамПредыдущегоПериода + ПоступлениеНаДату - СтрокаРасчетныеДанныеПоДням.УходимостьСредняяПоПродажамПредыдущегоПериода ;
			
			СтрокаРасчетныеДанныеПоДням.ПлановоеПоступлениеДня = ПоступлениеНаДату;
			СтрокаРасчетныеДанныеПоДням.ЗапасСУчетомУходимостиПоПлану = ЗапасСУчетомУходимостиПоПлану;
			СтрокаРасчетныеДанныеПоДням.ЗапасСУчетомУходимостиПоПродажамПредыдущегоПериода = ЗапасСУчетомУходимостиПоПродажамПредыдущегоПериода;

			
			ДатаСтроки = ДатаСтроки + 86400;	
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыводПолнойФормы(Команда)
	ТабДокумент = СформироватьТабДокументПолнойФормы ();
	ТабДокумент.Показать();

КонецПроцедуры

Функция СформироватьТабДокументПолнойФормы () 
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Документы.Лео_ПланЗапасаГП.ПолучитьМакет("МакетПолный");
	
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка|ОсновнаяОбласть");
	ОбластьШапкаОбластьДень = Макет.ПолучитьОбласть("Шапка|ОбластьДень");
    ТабДокумент.Вывести(ОбластьШапка);
	//ТабДокумент.НачатьАвтогруппировкуКолонок();
	
	ДатаСтроки = НачалоДня(Объект.Дата);	
	КонечнаяДата = ДатаСтроки + 864000;
	Пока ДатаСтроки <= КонечнаяДата Цикл
        ОбластьШапкаОбластьДень.Параметры.Дата1= Формат(ДатаСтроки,"ДФ=dd.MM.yyyy");
		ТабДокумент.Присоединить(ОбластьШапкаОбластьДень);
		ДатаСтроки = ДатаСтроки + 86400;	
	КонецЦикла;	
	
	ТзНоменклатурнаяГруппа = Объект.РасчетныеДанныеПоДням.Выгрузить(,"НоменклатурнаяГруппа");
	ТзНоменклатурнаяГруппа.Свернуть("НоменклатурнаяГруппа");
	ТзНоменклатурнаяГруппа.Сортировать("НоменклатурнаяГруппа");	
	
	ТчРасчетныеДанныеПоДням = Объект.РасчетныеДанныеПоДням;
	ТчРасчетныеДанные = Объект.РасчетныеДанные;
    ТчДанныеПланаПроиводстваГПОбщие = Объект.ДанныеПланаПроиводстваГПОбщие;
	
	НомерСтроки = 1;

	Для каждого СтрокаНоменклатурнаяГруппа из ТзНоменклатурнаяГруппа Цикл
		КонечнаяДата = ДатаСтроки + 864000;

		ОбластьНомГруппа = Макет.ПолучитьОбласть("НомГруппа|ОсновнаяОбласть");
		ОбластьНомГруппа.Параметры.ПП = НомерСтроки;
        ОбластьНомГруппа.Параметры.НоменклатурнаяГруппа = СтрокаНоменклатурнаяГруппа.НоменклатурнаяГруппа;
        ТабДокумент.Вывести(ОбластьНомГруппа);
		
		Пока ДатаСтроки <= КонечнаяДата Цикл
			//ТабДокумент.НачатьГруппуКолонок();
			ОбластьНомГруппаДень = Макет.ПолучитьОбласть("НомГруппа|ОбластьДень");
			ТабДокумент.Присоединить(ОбластьНомГруппаДень);
			ДатаСтроки = ДатаСтроки + 86400;
			//ТабДокумент.ЗакончитьГруппуКолонок();
		КонецЦикла;
		
		ПараметрыОтбораНоменклатуры = Новый Структура;
		ПараметрыОтбораНоменклатуры.Вставить("НоменклатурнаяГруппа", СтрокаНоменклатурнаяГруппа.НоменклатурнаяГруппа);
		ТзНоменклатура  =  Объект.РасчетныеДанныеПоДням.Выгрузить(ПараметрыОтбораНоменклатуры,"Номенклатура");
		ТзНоменклатура.Свернуть("Номенклатура");
		ТзНоменклатура.Сортировать("Номенклатура");

		ТабДокумент.НачатьГруппуСтрок(СтрокаНоменклатурнаяГруппа.НоменклатурнаяГруппа, Истина);

		Для каждого СтрокаНоменклатура из ТзНоменклатура Цикл
			ДатаСтроки = НачалоДня(Объект.Дата);	
			КонечнаяДата = ДатаСтроки + 864000;

			ОбластьСтрока = Макет.ПолучитьОбласть("Строка|ОсновнаяОбласть");
					
			ПараметрыОтбораРД = Новый Структура;
			ПараметрыОтбораРД.Вставить("Номенклатура", СтрокаНоменклатура.Номенклатура);
			НайденныеСтрокиРасчетныеДанные = ТчРасчетныеДанные.НайтиСтроки(ПараметрыОтбораРД);
			НайденыеСтрокиДанныеПланаПроиводстваГПОбщиеи = ТчДанныеПланаПроиводстваГПОбщие.НайтиСтроки(ПараметрыОтбораРД);

			
			//Данные из "РасчетныеДанные"
			Если НайденныеСтрокиРасчетныеДанные.количество() = 0 Тогда
				ОбластьСтрока.Параметры.ПП = НомерСтроки;
				ОбластьСтрока.Параметры.Номенклатура = СтрокаНоменклатура.Номенклатура;
				ОбластьСтрока.Параметры.Артикул = СтрокаНоменклатура.Номенклатура.Артикул;
                ОбластьСтрока.Параметры.НоменклатурнаяГруппа = СтрокаНоменклатурнаяГруппа.НоменклатурнаяГруппа;
			Иначе
				ОбластьСтрока.Параметры.ПП = НомерСтроки;
				ОбластьСтрока.Параметры.Номенклатура = СтрокаНоменклатура.Номенклатура;
				ОбластьСтрока.Параметры.Артикул = СтрокаНоменклатура.Номенклатура.Артикул;
	            ОбластьСтрока.Параметры.Заполнить(НайденныеСтрокиРасчетныеДанные[0]);
				ОбластьСтрока.Параметры.НоменклатурнаяГруппа = СтрокаНоменклатурнаяГруппа.НоменклатурнаяГруппа;
			КонецЕсли;
			
			Если НайденыеСтрокиДанныеПланаПроиводстваГПОбщиеи.количество() > 0 Тогда
	            ОбластьСтрока.Параметры.Заполнить(НайденыеСтрокиДанныеПланаПроиводстваГПОбщиеи[0]);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьСтрока);

			
			Пока ДатаСтроки <= КонечнаяДата Цикл                         
				ОбластьСтрокаОбластьДень = Макет.ПолучитьОбласть("Строка|ОблостьДеньГруп");
				ОбластьСтрокаОбластьДень2 = Макет.ПолучитьОбласть("Строка|ОблостьДеньГруп2");
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Номенклатура", СтрокаНоменклатура.Номенклатура);
	            ПараметрыОтбора.Вставить("Дата",ДатаСтроки);
				
				НайденныеСтрокиРасчетныеДанныеПоДням =  ТчРасчетныеДанныеПоДням.НайтиСтроки(ПараметрыОтбора);		
				
				//Получаем строку из "РасчетныеДанныеПоДням"
				Если НайденныеСтрокиРасчетныеДанныеПоДням.количество() = 0 Тогда
					
				Иначе
					ОбластьСтрокаОбластьДень.Параметры.Заполнить( НайденныеСтрокиРасчетныеДанныеПоДням[0]);
					
					НеснижаемыйОстаток = Число (?(НайденныеСтрокиРасчетныеДанныеПоДням[0].НеснижаемыйОстаток = "",0,НайденныеСтрокиРасчетныеДанныеПоДням[0].НеснижаемыйОстаток));
					ЗапасСУчетомУходимостиПоПлану = НайденныеСтрокиРасчетныеДанныеПоДням[0].ЗапасСУчетомУходимостиПоПлану;
					ЗапасСУчетомУходимостиПоПродажамПредыдущегоПериода = НайденныеСтрокиРасчетныеДанныеПоДням[0].ЗапасСУчетомУходимостиПоПродажамПредыдущегоПериода;
					
					ПроцентОтНиснежаемогоОстаткаПоПлану  = 0;
					ПроцентОтНиснежаемогоОстаткаПоПродажамПредыдущегоПериода = 0;

					Если НеснижаемыйОстаток > 0 Тогда
						ПроцентОтНиснежаемогоОстаткаПоПлану  = ЗапасСУчетомУходимостиПоПлану/НеснижаемыйОстаток*100;
						ПроцентОтНиснежаемогоОстаткаПоПродажамПредыдущегоПериода = ЗапасСУчетомУходимостиПоПродажамПредыдущегоПериода/НеснижаемыйОстаток*100;
						ОбластьСтрокаОбластьДень2.Параметры.ПроцентОтНиснежаемогоОстаткаПоПлану = Формат( ПроцентОтНиснежаемогоОстаткаПоПлану ,"ЧЦ=5; ЧДЦ=0");
						ОбластьСтрокаОбластьДень2.Параметры.ПроцентОтНиснежаемогоОстаткаПоПродажамПредыдущегоПериода = Формат( ПроцентОтНиснежаемогоОстаткаПоПродажамПредыдущегоПериода ,"ЧЦ=5; ЧДЦ=0");
					Иначе
						ПроцентОтНиснежаемогоОстаткаПоПлану  = 0;
					    ПроцентОтНиснежаемогоОстаткаПоПродажамПредыдущегоПериода = 0;

						ОбластьСтрокаОбластьДень2.Параметры.ПроцентОтНиснежаемогоОстаткаПоПлану = 0;
						ОбластьСтрокаОбластьДень2.Параметры.ПроцентОтНиснежаемогоОстаткаПоПродажамПредыдущегоПериода = 0;
					КонецЕсли;
				КонецЕсли;
				
				//Раскрашиывем ячейки процента
				ТабДокумент.НачатьГруппуКолонок();
				ТабДокумент.Присоединить(ОбластьСтрокаОбластьДень);
				ТабДокумент.ЗакончитьГруппуКолонок();

				ОбластьОформления = ТабДокумент.Присоединить(ОбластьСтрокаОбластьДень2);
				Если ПроцентОтНиснежаемогоОстаткаПоПлану = 0 Тогда
					ЦветЯчейки1= WebЦвета.Белый;
				ИначеЕсли ПроцентОтНиснежаемогоОстаткаПоПлану < 50 Тогда
					ЦветЯчейки1= WebЦвета.ЛососьСветлый;
				ИначеЕсли ПроцентОтНиснежаемогоОстаткаПоПлану < 90 Тогда
					ЦветЯчейки1= WebЦвета.СветлоЗолотистый;
				Иначе
					ЦветЯчейки1= WebЦвета.Белый;
				КонецЕсли;	
				
				Если ПроцентОтНиснежаемогоОстаткаПоПродажамПредыдущегоПериода = 0 Тогда
					ЦветЯчейки2= WebЦвета.Белый;
				ИначеЕсли ПроцентОтНиснежаемогоОстаткаПоПродажамПредыдущегоПериода < 50 Тогда
					ЦветЯчейки2= WebЦвета.ЛососьСветлый;
				ИначеЕсли ПроцентОтНиснежаемогоОстаткаПоПродажамПредыдущегоПериода < 90 Тогда
					ЦветЯчейки2= WebЦвета.СветлоЗолотистый;
				Иначе
					ЦветЯчейки2= WebЦвета.Белый;	
				КонецЕсли;	
				ТабДокумент.Область(ОбластьОформления.Верх, ОбластьОформления.Право, ОбластьОформления.Низ, ОбластьОформления.Право).ЦветФона = ЦветЯчейки2;
				ТабДокумент.Область(ОбластьОформления.Верх, ОбластьОформления.Право-1, ОбластьОформления.Низ, ОбластьОформления.Право-1).ЦветФона = ЦветЯчейки1;
				
				
				ДатаСтроки = ДатаСтроки + 86400;	
			КонецЦикла;
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		ТабДокумент.ЗакончитьГруппуСтрок();
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	//ТабДокумент.ЗакончитьАвтогруппировкуКолонок();
	Возврат ТабДокумент
	
КонецФункции
